Revit 2024 API
SymbolicCurve.SetVisibility Method
Sets the visibility for the symbolic curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetVisibility(
	FamilyElementVisibility visibility
)
Visual Basic
Public Sub SetVisibility ( _
	visibility As FamilyElementVisibility _
)
Visual C++
public:
void SetVisibility(
	FamilyElementVisibility^ visibility
)
Parameters
visibility
Type: Autodesk.Revit.DB.FamilyElementVisibility
Remarks
The visibility of the symbolic curve geometry can be changed for different detail levels.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when visibility is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when visibility is not valid for symbolic curves.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when regeneration failed.
See Also
SymbolicCurve Class
Autodesk.Revit.DB Namespace